# OwnerId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingPreferenceManager..::..OwnerId Property
RoutingPreferenceManager Class See Also
---
The Id of the MEPCurveType that owns the RoutingPreferenceManager
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId OwnerId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OwnerId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ OwnerId {
	ElementId^ get ();
}
```

# See Also
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace